# Import Pandas Library

In [194]:
#!pip install pandas

In [8]:
import pandas as pd
import numpy as np

# Data Structures

## First: Series

In [12]:
lst = [1,2,3,4,5] 
s = pd.Series(lst)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [14]:
# change dtype
s = pd.Series(lst, dtype= float)

In [16]:
s.dtype, type(s)

(dtype('float64'), pandas.core.series.Series)

In [18]:
# choose indexes
s = pd.Series(lst, index=['A', 'B', 'C', 'D', 'E' ])
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [20]:
index = [10, 12, 13, 14]
names = ['Nourah', 'Sarah', 'Ahmed', 'Lama']
s2 = pd.Series(data=names, index=index)
s2

10    Nourah
12     Sarah
13     Ahmed
14      Lama
dtype: object

In [22]:
# use dictionary 
names = {10: 'Nourah', 12: 'Sarah', 13: 'Ahmed', 14: 'Lama'}
s3 = pd.Series(names)
s3

10    Nourah
12     Sarah
13     Ahmed
14      Lama
dtype: object

In [24]:
s3.index

Index([10, 12, 13, 14], dtype='int64')

In [104]:
# change the indexes
s3.index = [10, 20, 30, 40]
s3

10    Nourah
20     Sarah
30     Ahmed
40      Lama
dtype: object

In [102]:
fruit1 = {'Apple': 40 , 'Banana': 50, 'Orange': 60}
ser1 = pd.Series(fruit1)

fruit2 = {'Apple': 30 , 'Strawberry': 20, 'Orange': 20}
ser2 = pd.Series(fruit2)

In [30]:
ser1

Apple     40
Banana    50
Orange    60
dtype: int64

In [32]:
s3

10    Nourah
20     Sarah
30     Ahmed
40      Lama
dtype: object

In [106]:
# index location
s3[1:2]

# Slicing like numpy [start: end(execluded): gap]
# Note that the slice does not use the index labels as references, but the position

20    Sarah
dtype: object

In [116]:
# index label
s3[40]

'Lama'

In [38]:
# index label
s3.loc[ [20, 40], ]

20    Sarah
40     Lama
dtype: object

In [40]:
# index location
s3.iloc[[1], ]

20    Sarah
dtype: object

In [42]:
# Selecting
print(s3[20]) # index = 20

Sarah

In [44]:
s3[:-1] # from 0 to last item(execluded)

10    Nourah
20     Sarah
30     Ahmed
dtype: object

In [46]:
s3

10    Nourah
20     Sarah
30     Ahmed
40      Lama
dtype: object

In [48]:
# Add elements 
s4 = pd.Series({50: 'Ahmed', 60: 'Nada'})
s3 = s3._append(s4)
s3

10    Nourah
20     Sarah
30     Ahmed
40      Lama
50     Ahmed
60      Nada
dtype: object

In [50]:
x = pd.Series(['a', 'b'])
y = pd.Series(['c', 'd'])

In [52]:
x

0    a
1    b
dtype: object

In [54]:
y

0    c
1    d
dtype: object

In [56]:
z = pd.concat([x, y])
z

0    a
1    b
0    c
1    d
dtype: object

In [58]:
z = pd.concat([x, y],ignore_index=True )
z

0    a
1    b
2    c
3    d
dtype: object

In [60]:
s3[s3.duplicated(keep=False)]

30    Ahmed
50    Ahmed
dtype: object

In [62]:
# delete an element 
# method 1
s3 = s3.drop(50)

In [64]:
#method 2
s3.drop(60, inplace=True)

In [66]:
# WRONG
# s3 = s3.drop(50, inplace=True)

In [68]:
s3

10    Nourah
20     Sarah
30     Ahmed
40      Lama
dtype: object

In [70]:
# drop duplicate elements
s3 = s3.drop_duplicates()

In [72]:
s3

10    Nourah
20     Sarah
30     Ahmed
40      Lama
dtype: object

In [74]:
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [76]:
s4 = s.copy()
s4
s4['A'] = 5
s4

A    5
B    2
C    3
D    4
E    5
dtype: int64

In [78]:
#WRONG
#s4 = s
#s4['A'] = 5
#s

In [80]:
s4

A    5
B    2
C    3
D    4
E    5
dtype: int64

In [82]:
s4 = s4.mul(3)
s4

A    15
B     6
C     9
D    12
E    15
dtype: int64

In [84]:
s4.add(s)

A    16
B     8
C    12
D    16
E    20
dtype: int64

In [86]:
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [88]:
s4.sub(s)

A    14
B     4
C     6
D     8
E    10
dtype: int64

In [90]:
s4 * s

A    15
B    12
C    27
D    48
E    75
dtype: int64

In [92]:
s4 = s4.mul(s)

In [94]:
s4.div(s)

A    15.0
B     6.0
C     9.0
D    12.0
E    15.0
dtype: float64

In [96]:
s5

NameError: name 's5' is not defined

In [98]:
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [100]:
s5 = pd.Series({'A': 6, 'B': 8})
s5 = s5.add(s, fill_value=-1)

In [253]:
s5 # you have to save the result

A     7.0
B    10.0
C     2.0
D     3.0
E     4.0
dtype: float64

## Second: DataFrame

### A- Creating a new DataFrame from the scratch

In [118]:
#data = {column_name1: list,
#        column_name2: list}

data = {'SalesPerson': ['Kathey', 'Michael', 'William', 'Kathey', 'William', 'Kathey', 'Michael'],
        'Region': ['East', 'West', 'North', 'South', 'North', 'North', 'East'],
        'OrderAmount': [600, 700, 400, 500, 400, 700, 800],
        'Month': ['Jan', 'Feb', 'Feb', 'Mar', 'May', 'Apr', 'May'],
        'isAccepted': [True, False, False, True, True, True, False]
       }

SalesDF = pd.DataFrame(data)

  SalesPerson Region  OrderAmount Month  isAccepted
0      Kathey   East          600   Jan        True
1     Michael   West          700   Feb       False
2     William  North          400   Feb       False
3      Kathey  South          500   Mar        True
4     William  North          400   May        True
5      Kathey  North          700   Apr        True
6     Michael   East          800   May       False

In [120]:
data = {'year': [2010, 2011, 2012, 2010, 2011, 2012, 2010, 2011, 2012],
        'team': ['FCBarcelona', 'FCBarcelona', 'FCBarcelona', 'RMadrid', 'RMadrid', 'RMadrid', 'ValenciaCF',
                 'ValenciaCF', 'ValenciaCF'],
        'wins':   [30, 28, 32, 29, 32, 26, 21, 17, 19],
        'draws':  [6, 7, 4, 5, 4, 7, 8, 10, 8],
        'losses': [2, 3, 2, 4, 2, 5, 9, 11, 11]}

football = pd.DataFrame(data)
football

   year         team  wins  draws  losses
0  2010  FCBarcelona    30      6       2
1  2011  FCBarcelona    28      7       3
2  2012  FCBarcelona    32      4       2
3  2010      RMadrid    29      5       4
4  2011      RMadrid    32      4       2
5  2012      RMadrid    26      7       5
6  2010   ValenciaCF    21      8       9
7  2011   ValenciaCF    17     10      11
8  2012   ValenciaCF    19      8      11

### B- Reading tabular data

In [132]:
edu = pd.read_csv('instagram_users.csv')
edu

,pos,flw,flg,bl,pic,lin,cl,cz,ni,erl,erc,lt,hc,pr,fo,cs,pi,class
0,44,48,325,33,1,0,12,0.000000,0.000,0.000000,0.00,0.000,0.000,0.0,0.000,0.111111,0.094985,f
1,10,66,321,150,1,0,213,0.000000,1.000,14.390000,1.97,0.000,1.500,0.0,0.000,0.206826,230.412857,f
2,33,970,308,101,1,1,436,0.000000,1.000,10.100000,0.30,0.000,2.500,0.0,0.056,0.572174,43.569939,f
3,70,86,360,14,1,0,0,1.000000,0.000,0.780000,0.06,0.000,0.000,0.0,0.000,1.000000,5.859799,f
4,3,21,285,73,1,0,93,0.000000,0.000,14.290000,0.00,0.667,0.000,0.0,0.000,0.300494,0.126019,f
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
65321,13,145,642,0,1,0,7,0.461538,0.000,14.270000,0.58,0.000,0.077,0.0,0.000,0.192308,1745.291260,r
65322,652,3000,1300,146,1,1,384,0.000000,0.389,8.520000,0.13,0.000,1.611,0.0,0.000,0.169917,54.629120,r
65323,1500,3700,3200,147,1,1,129,0.000000,0.111,9.390000,0.31,0.722,0.000,0.0,0.056,0.058908,129.802048,r
65324,329,1500,1800,218,1,1,290,0.055556,0.000,6.350000,0.26,0.222,0.500,0.0,0.000,0.103174,53.402840,r
65325,206,659,608,27,1,0,77,0.000000,0.333,25.549999,0.53,0.222,0.222,0.0,0.167,0.017505,604.981445,r

In [134]:
edu.dtypes

pos        int64
flw        int64
flg        int64
bl         int64
pic        int64
lin        int64
cl         int64
cz       float64
ni       float64
erl      float64
erc      float64
lt       float64
hc       float64
pr       float64
fo       float64
cs       float64
pi       float64
class     object
dtype: object

# Viewing Data

In [137]:
edu.tail(2)

,pos,flw,flg,bl,pic,lin,cl,cz,ni,erl,erc,lt,hc,pr,fo,cs,pi,class
65324,329,1500,1800,218,1,1,290,0.055556,0.000,6.350000,0.26,0.222,0.500,0.0,0.000,0.103174,53.402840,r
65325,206,659,608,27,1,0,77,0.000000,0.333,25.549999,0.53,0.222,0.222,0.0,0.167,0.017505,604.981445,r

In [139]:
edu.head(2) #first rows that are listed

,pos,flw,flg,bl,pic,lin,cl,cz,ni,erl,erc,lt,hc,pr,fo,cs,pi,class
0,44,48,325,33,1,0,12,0.0,0.0,0.00,0.00,0.0,0.0,0.0,0.0,0.111111,0.094985,f
1,10,66,321,150,1,0,213,0.0,1.0,14.39,1.97,0.0,1.5,0.0,0.0,0.206826,230.412857,f

In [141]:
edu.dtypes

pos        int64
flw        int64
flg        int64
bl         int64
pic        int64
lin        int64
cl         int64
cz       float64
ni       float64
erl      float64
erc      float64
lt       float64
hc       float64
pr       float64
fo       float64
cs       float64
pi       float64
class     object
dtype: object

In [143]:
edu.shape

(65326, 18)

In [145]:
edu.columns

Index(['pos', 'flw', 'flg', 'bl', 'pic', 'lin', 'cl', 'cz', 'ni', 'erl', 'erc',
       'lt', 'hc', 'pr', 'fo', 'cs', 'pi', 'class'],
      dtype='object')

In [149]:
edu.columns = ['TIME', 'GEO', 'INDIC_ED', 'Value_str', 'Flag and Footnotes','lin', 'cl', 'cz', 'ni', 'erl', 'erc',
       'lt', 'hc', 'pr', 'fo', 'cs', 'pi', 'class']

In [151]:
edu.rename(columns={'TIME': 'TIME_1'}, inplace=True)

In [276]:
edu.columns

Index(['TIME_1', 'GEO', 'INDIC_ED', 'Value_str', 'Flag and Footnotes'], dtype='object')

In [277]:
edu.columns[3] = "Value_changed"

TypeError: Index does not support mutable operations

In [153]:
edu.index

RangeIndex(start=0, stop=65326, step=1)

In [283]:
edu.values # values of any DataFrame can be retrieved as a Python array by calling its values attribute.

array([[2000, 'European Union (28 countries)',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        ':', nan],
       [2001, 'European Union (28 countries)',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        ':', nan],
       [2002, 'European Union (28 countries)',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        '5.00', 'e'],
       ...,
       [2009, 'Finland',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        '6.81', nan],
       [2010, 'Finland',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        '6.85', nan],
       [2011, 'Finland',
        'Total public expenditure on education as % of GDP, for all levels of education combined',
        '6.76', nan]], dtype=object)

In [155]:
# quick statistical information
edu.describe()

,TIME_1,GEO,INDIC_ED,Value_str,Flag and Footnotes,lin,cl,cz,ni,erl,erc,lt,hc,pr,fo,cs,pi
count,65326.000000,6.532600e+04,65326.000000,65326.000000,65326.000000,65326.000000,65326.000000,65326.000000,65326.000000,65326.000000,65326.000000,65326.000000,65326.000000,65326.000000,65326.000000,65326.000000,65326.000000
mean,176.571227,1.183077e+03,2310.519211,57.497061,0.951765,0.281925,136.520344,0.250012,0.193229,19.146641,1.139421,0.208877,0.507796,0.032745,0.052837,0.299098,496.475193
std,723.470655,2.170802e+04,2592.096104,64.129260,0.214264,0.449940,215.714486,0.337891,0.252939,121.047570,5.810627,0.300362,1.156921,0.220987,0.519058,0.349604,944.905389
min,0.000000,0.000000e+00,0.000000,0.000000,0.000000,0.000000,-1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,6.000000,1.230000e+02,394.000000,0.000000,1.000000,0.000000,8.000000,0.000000,0.000000,2.730000,0.080000,0.000000,0.000000,0.000000,0.000000,0.033327,24.571458
50%,30.000000,3.380000e+02,995.000000,32.000000,1.000000,0.000000,46.000000,0.055556,0.059000,9.450000,0.440000,0.000000,0.077000,0.000000,0.000000,0.136915,183.227943
75%,124.000000,8.170000e+02,3600.000000,110.000000,1.000000,1.000000,170.000000,0.444444,0.333000,18.680000,1.040000,0.333000,0.611000,0.000000,0.000000,0.456342,580.771927
max,76200.000000,3.900000e+06,8800.000000,555.000000,1.000000,1.000000,3644.000000,1.000000,1.000000,26650.000000,1009.090027,1.000000,30.000000,20.000000,58.000000,1.000000,26786.134766

In [157]:
edu.describe(include="all")

NameError: name 'table' is not defined

In [287]:
edu.describe(exclude="number").T

,count,unique,top,freq
GEO,384,32,European Union (28 countries),12
INDIC_ED,384,1,Total public expenditure on education as % of ...,384
Value_str,384,211,:,23
Flag and Footnotes,165,6,e,70

In [289]:
edu.T

,0,1,2,3,4,5,6,7,8,9,...,374,375,376,377,378,379,380,381,382,383
TIME_1,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,...,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011
GEO,European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),...,Finland,Finland,Finland,Finland,Finland,Finland,Finland,Finland,Finland,Finland
INDIC_ED,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...,Total public expenditure on education as % of ...
Value_str,:,:,5.00,5.03,4.95,4.92,4.91,4.92,5.04,5.38,...,6.22,6.43,6.42,6.30,6.18,5.90,6.10,6.81,6.85,6.76
Flag and Footnotes,NaN,NaN,e,e,e,e,e,e,e,e,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# Selection

In [ ]:
edu.head(2)

In [296]:
edu['Value_str'] # The result will be a Series data structure, not a DataFrame, because only one column is retrieved.

0         :
1         :
2      5.00
3      5.03
4      4.95
       ...
379    5.90
380    6.10
381    6.81
382    6.85
383    6.76
Name: Value_str, Length: 384, dtype: object

In [297]:
edu[['Value_str','GEO']]

    Value_str                            GEO
0           :  European Union (28 countries)
1           :  European Union (28 countries)
2        5.00  European Union (28 countries)
3        5.03  European Union (28 countries)
4        4.95  European Union (28 countries)
..        ...                            ...
379      5.90                        Finland
380      6.10                        Finland
381      6.81                        Finland
382      6.85                        Finland
383      6.76                        Finland

[384 rows x 2 columns]

In [301]:

edu.loc[[0, 10, 300],['Value_str','GEO']] #labels
edu.loc[0,9,90,91]['','']

    Value_str                            GEO
0           :  European Union (28 countries)
10       5.41  European Union (28 countries)
300      5.66                        Austria

In [303]:
edu.iloc[[0, 10, 300],[0, 2]]

     TIME_1                                           INDIC_ED
0      2000  Total public expenditure on education as % of ...
10     2010  Total public expenditure on education as % of ...
300    2000  Total public expenditure on education as % of ...

In [311]:
edu[10:14]# select a subset of rows from a DataFrame

,TIME_1,GEO,INDIC_ED,Value_str,Flag and Footnotes
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
13,2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s

In [312]:
edu.loc[[0, 10, 300],['Value_str','GEO']] #labels
edu.loc[90:94, [ 'GEO']]  #[rows, columns]

        GEO
90  Belgium
91  Belgium
92  Belgium
93  Belgium
94  Belgium

In [317]:
edu.loc[90:94, :] #[rows, columns=all]

,TIME_1,GEO,INDIC_ED,Value_str,Flag and Footnotes
90,2006,Belgium,Total public expenditure on education as % of ...,5.98,d
91,2007,Belgium,Total public expenditure on education as % of ...,6.00,d
92,2008,Belgium,Total public expenditure on education as % of ...,6.43,d
93,2009,Belgium,Total public expenditure on education as % of ...,6.57,d
94,2010,Belgium,Total public expenditure on education as % of ...,6.58,d

In [335]:
edu.sample(10,random_state=16) # random sample >> 23 seed for random number generator.
# seed makes the random numbers predictable

,TIME_1,GEO,INDIC_ED,Value_str,Flag and Footnotes
347,2011,Romania,Total public expenditure on education as % of ...,3.07,NaN
256,2004,Luxembourg,Total public expenditure on education as % of ...,3.87,d
132,2000,Germany (until 1990 former territory of the FRG),Total public expenditure on education as % of ...,4.45,NaN
271,2007,Hungary,Total public expenditure on education as % of ...,5.29,NaN
159,2003,Ireland,Total public expenditure on education as % of ...,4.35,NaN
217,2001,Cyprus,Total public expenditure on education as % of ...,5.98,i
199,2007,France,Total public expenditure on education as % of ...,5.62,NaN
64,2004,Euro area (15 countries),Total public expenditure on education as % of ...,4.96,e
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
255,2003,Luxembourg,Total public expenditure on education as % of ...,3.77,d

# Filtering Data

In [159]:
edu

,TIME_1,GEO,INDIC_ED,Value_str,Flag and Footnotes,lin,cl,cz,ni,erl,erc,lt,hc,pr,fo,cs,pi,class
0,44,48,325,33,1,0,12,0.000000,0.000,0.000000,0.00,0.000,0.000,0.0,0.000,0.111111,0.094985,f
1,10,66,321,150,1,0,213,0.000000,1.000,14.390000,1.97,0.000,1.500,0.0,0.000,0.206826,230.412857,f
2,33,970,308,101,1,1,436,0.000000,1.000,10.100000,0.30,0.000,2.500,0.0,0.056,0.572174,43.569939,f
3,70,86,360,14,1,0,0,1.000000,0.000,0.780000,0.06,0.000,0.000,0.0,0.000,1.000000,5.859799,f
4,3,21,285,73,1,0,93,0.000000,0.000,14.290000,0.00,0.667,0.000,0.0,0.000,0.300494,0.126019,f
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
65321,13,145,642,0,1,0,7,0.461538,0.000,14.270000,0.58,0.000,0.077,0.0,0.000,0.192308,1745.291260,r
65322,652,3000,1300,146,1,1,384,0.000000,0.389,8.520000,0.13,0.000,1.611,0.0,0.000,0.169917,54.629120,r
65323,1500,3700,3200,147,1,1,129,0.000000,0.111,9.390000,0.31,0.722,0.000,0.0,0.056,0.058908,129.802048,r
65324,329,1500,1800,218,1,1,290,0.055556,0.000,6.350000,0.26,0.222,0.500,0.0,0.000,0.103174,53.402840,r
65325,206,659,608,27,1,0,77,0.000000,0.333,25.549999,0.53,0.222,0.222,0.0,0.167,0.017505,604.981445,r

In [349]:
edu[(edu['Value_str'] == "5.00") | (edu['Flag and Footnotes'] == "e")]
edu[(edu['x']>30)&(edu['y']>50])]

,TIME_1,GEO,INDIC_ED,Value_str,Flag and Footnotes
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
...,...,...,...,...,...
79,2007,Euro area (13 countries),Total public expenditure on education as % of ...,4.80,e
80,2008,Euro area (13 countries),Total public expenditure on education as % of ...,4.94,e
81,2009,Euro area (13 countries),Total public expenditure on education as % of ...,5.32,e
82,2010,Euro area (13 countries),Total public expenditure on education as % of ...,5.28,e
83,2011,Euro area (13 countries),Total public expenditure on education as % of ...,5.15,e

In [343]:
edu[edu['Value_str'] == "4.41"]

,TIME_1,GEO,INDIC_ED,Value_str,Flag and Footnotes
209,2005,Italy,Total public expenditure on education as % of ...,4.41,NaN

In [351]:
mask = (edu['Value_str'] > "6.5") & (edu['TIME_1'] ==2000)

In [352]:
edu[mask]

,TIME_1,GEO,INDIC_ED,Value_str,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
36,2000,Euro area (18 countries),Total public expenditure on education as % of ...,:,NaN
48,2000,Euro area (17 countries),Total public expenditure on education as % of ...,:,NaN
60,2000,Euro area (15 countries),Total public expenditure on education as % of ...,:,u
72,2000,Euro area (13 countries),Total public expenditure on education as % of ...,:,u
84,2000,Belgium,Total public expenditure on education as % of ...,:,u
120,2000,Denmark,Total public expenditure on education as % of ...,8.28,i
252,2000,Luxembourg,Total public expenditure on education as % of ...,:,NaN
348,2000,Slovenia,Total public expenditure on education as % of ...,:,NaN

In [ ]:
# Another way of selection
# by applying Boolean indexing. This indexing is commonly known as a filter. 
edu[edu['Value_str'] > 6.5]

# Filtering Missing and dupliacated Values

In [354]:
edu.isnull().sum()
edu.isnull().sum()

TIME_1                  0
GEO                     0
INDIC_ED                0
Value_str               0
Flag and Footnotes    219
dtype: int64

In [357]:
edu['Value_str'].isnull().sum()

0

In [367]:
edu.isnull().any()

TIME_1                False
GEO                   False
INDIC_ED              False
Value_str             False
Flag and Footnotes     True
dtype: bool

In [365]:
edu.isnull().any(axis=1)

0       True
1       True
2      False
3      False
4      False
       ...
379     True
380     True
381     True
382     True
383     True
Length: 384, dtype: bool

In [363]:
edu[edu.isnull().any(axis=1)]
edu

,TIME_1,GEO,INDIC_ED,Value_str,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
36,2000,Euro area (18 countries),Total public expenditure on education as % of ...,:,NaN
37,2001,Euro area (18 countries),Total public expenditure on education as % of ...,:,NaN
48,2000,Euro area (17 countries),Total public expenditure on education as % of ...,:,NaN
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [163]:
ind = edu[edu.isnull().any(axis=1)].index

ind
#edu.drop(ind)

Index([], dtype='int64')

In [368]:
edu[edu['Flag and Footnotes'].isnull()]#.head()

,TIME_1,GEO,INDIC_ED,Value_str,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
36,2000,Euro area (18 countries),Total public expenditure on education as % of ...,:,NaN
37,2001,Euro area (18 countries),Total public expenditure on education as % of ...,:,NaN
48,2000,Euro area (17 countries),Total public expenditure on education as % of ...,:,NaN
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [175]:
edu.duplicated(['Value_str'])

#edu[mask]

0        False
1        False
2        False
3        False
4        False
         ...
65321     True
65322     True
65323     True
65324     True
65325     True
Length: 65326, dtype: bool

In [ ]:
edu.shape

In [177]:
edu.drop_duplicates('Value_str')

,TIME_1,GEO,INDIC_ED,Value_str,Flag and Footnotes,lin,cl,cz,ni,erl,erc,lt,hc,pr,fo,cs,pi,class
0,44,48,325,33,1,0,12,0.000000,0.000,0.000000,0.00,0.000,0.000,0.0,0.000,0.111111,0.094985,f
1,10,66,321,150,1,0,213,0.000000,1.000,14.390000,1.97,0.000,1.500,0.0,0.000,0.206826,230.412857,f
2,33,970,308,101,1,1,436,0.000000,1.000,10.100000,0.30,0.000,2.500,0.0,0.056,0.572174,43.569939,f
3,70,86,360,14,1,0,0,1.000000,0.000,0.780000,0.06,0.000,0.000,0.0,0.000,1.000000,5.859799,f
4,3,21,285,73,1,0,93,0.000000,0.000,14.290000,0.00,0.667,0.000,0.0,0.000,0.300494,0.126019,f
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
63212,5,213,210,355,1,0,285,0.000000,0.600,14.840000,0.94,0.000,0.000,0.2,0.000,0.007670,1606.668457,r
63368,471,2000,997,316,1,1,424,0.000000,0.389,5.530000,0.09,0.111,0.167,0.0,0.056,0.067082,606.826965,r
63878,17,427,3200,315,1,0,11,0.470588,0.118,22.299999,3.94,0.000,0.000,0.0,0.000,0.205882,718.671753,r
64573,1300,1300,6800,422,1,1,1192,0.000000,0.222,0.110000,0.01,1.000,0.556,0.0,0.000,0.346136,1.459506,r
64898,29,426,2500,297,1,0,169,0.000000,0.500,19.410000,0.99,0.667,0.833,0.0,0.389,0.049185,494.693085,r

# Manipulating Data

In [382]:
edu.head()

,TIME_1,GEO,INDIC_ED,Value_str,Flag and Footnotes,Value
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e,5.0
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e,5.0
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e,4.0

In [383]:
edu['Value'] / 100 # you can apply it by one step

0       NaN
1       NaN
2      0.05
3      0.05
4      0.04
       ...
379    0.05
380    0.06
381    0.06
382    0.06
383    0.06
Name: Value, Length: 384, dtype: float64

In [179]:
edu['Value'] = edu[edu['Value_str'] != ":"]['Value_str'].astype(float).astype(int)

In [374]:
edu['Value_str'].astype(float)

ValueError: could not convert string to float: ':'

In [ ]:
edu['Value_str'] = edu['Value_str'].astype(float).astype(int)

In [384]:
edu['Value'] **2

0       NaN
1       NaN
2      25.0
3      25.0
4      16.0
       ...
379    25.0
380    36.0
381    36.0
382    36.0
383    36.0
Name: Value, Length: 384, dtype: float64

In [390]:
# we can apply any function to a DataFrame or Series
edu['Value'].apply(np.sqrt) # sqrt function from the numpy library

0           NaN
1           NaN
2      2.236068
3      2.236068
4      2.000000
         ...
379    2.236068
380    2.449490
381    2.449490
382    2.449490
383    2.449490
Name: Value, Length: 384, dtype: float64

In [391]:
edu['Value'].map(np.sqrt)

0           NaN
1           NaN
2      2.236068
3      2.236068
4      2.000000
         ...
379    2.236068
380    2.449490
381    2.449490
382    2.449490
383    2.449490
Name: Value, Length: 384, dtype: float64

In [386]:
def f2(x):
    if x > 3:
        return x**2
    else:
        return x**3

In [388]:
edu['Value'].map(f2)

0       NaN
1       NaN
2      25.0
3      25.0
4      16.0
       ...
379    25.0
380    36.0
381    36.0
382    36.0
383    36.0
Name: Value, Length: 384, dtype: float64

In [387]:
edu['Value'].apply(f2)

0       NaN
1       NaN
2      25.0
3      25.0
4      16.0
       ...
379    25.0
380    36.0
381    36.0
382    36.0
383    36.0
Name: Value, Length: 384, dtype: float64

In [ ]:
edu.head(2)

In [392]:
s = lambda d: d**2
s(5)

25

In [ ]:
edu['Value'].apply(lambda d: d**2)
edu['Value'].apply(s)

In [ ]:
edu.head(2)

In [393]:
mul = lambda a: a[0]+a[1]

In [395]:
edu.head(2)

,TIME_1,GEO,INDIC_ED,Value_str,Flag and Footnotes,Value
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN,NaN

In [394]:
edu[['Value','TIME_1']].apply(mul, axis=1)

/var/folders/9n/yvd02hfx57z6hx0832zwsdrr0000gn/T/ipykernel_89578/967055474.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  mul = lambda a: a[0]+a[1]

0         NaN
1         NaN
2      2007.0
3      2008.0
4      2008.0
        ...
379    2012.0
380    2014.0
381    2015.0
382    2016.0
383    2017.0
Length: 384, dtype: float64

In [ ]:
# remove this column from the DataFrame
# rows(axis=0), columns(axis=1) 
# inplace = False (default), inplace=True (change original DataFrame)
edu.drop('ValueNorm', axis=1, inplace=True)
edu.head()

In [ ]:
edu.drop(["GEO", ], axis=1)

In [360]:
edu.drop(index=[3, 2,5])

,TIME_1,GEO,INDIC_ED,Value_str,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [ ]:
s = edu[edu['Value_str'] > 6.5].index

In [ ]:
edu.drop(s)

# Sorting

In [ ]:
edu

In [397]:
edu.sort_values(by='Value', ascending=False)

,TIME_1,GEO,INDIC_ED,Value_str,Flag and Footnotes,Value
124,2004,Denmark,Total public expenditure on education as % of ...,8.43,NaN,8.0
120,2000,Denmark,Total public expenditure on education as % of ...,8.28,i,8.0
121,2001,Denmark,Total public expenditure on education as % of ...,8.44,d,8.0
122,2002,Denmark,Total public expenditure on education as % of ...,8.44,d,8.0
123,2003,Denmark,Total public expenditure on education as % of ...,8.33,NaN,8.0
...,...,...,...,...,...,...
262,2010,Luxembourg,Total public expenditure on education as % of ...,:,NaN,NaN
263,2011,Luxembourg,Total public expenditure on education as % of ...,:,NaN,NaN
342,2006,Romania,Total public expenditure on education as % of ...,:,u,NaN
344,2008,Romania,Total public expenditure on education as % of ...,:,u,NaN
348,2000,Slovenia,Total public expenditure on education as % of ...,:,NaN,NaN

In [398]:
# to return to the original order, we can sort by an index using the sort_index and axis=0
edu.sort_index(axis=0, ascending=True, inplace=True)
edu.head()

,TIME_1,GEO,INDIC_ED,Value_str,Flag and Footnotes,Value
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e,5.0
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e,5.0
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e,4.0

# Grouping Data

In [ ]:
# By â€œgroup byâ€ we are referring to a process involving one or more of the following steps:
# 1. Splitting the data into groups based on some criteria
# 2. Applying a function to each group independently
# 3. Combining the results into a data structure

In [ ]:
edu['TIME_1'].max()

In [ ]:
edu['Value_str'].value_counts()

In [ ]:
edu['Value_str'].unique()

In [ ]:
edu.groupby(['Value_str', 'GEO'])[['TIME_1']].max()

In [ ]:
lst = list(edu.groupby('Value_str'))
t = lst[4]
t[1]

In [ ]:
# like group by in sql
group = edu[['GEO', 'Value']].groupby('GEO').mean()
group.head()

# Merging Data

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4))

In [ ]:
df

In [ ]:
left = df[:3]
right = df[2:]

In [ ]:
left

In [ ]:
right

In [ ]:
df[7:]

In [ ]:
pd.concat([left, right])

In [ ]:
left.columns

In [ ]:
pd.concat((left, right), axis=1, ignore_index=True)

In [ ]:
left

In [ ]:
right

In [ ]:
pd.merge(left, right, on=1, how='outer')

# Resources
- Chapter 2, Introduction to Data Science by Laura Igual and Santi SeguÃ­
    - https://github.com/DataScienceUB/introduction-datascience-python-book 
- pandas Documentation: https://pandas.pydata.org/